SM_для_EDT/src/Enums/vftСтатусыДокументаРапортОПовреждении/vftСтатусыДокументаРапортОПовреждении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>vftСтатусыДокументаРапортОПовреждении</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Рассмотрен</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/vftСтатусыДокументовСообщений/vftСтатусыДокументовСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>vftСтатусыДокументовСообщений</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Инициировано</name>
  </enumValues>
  <enumValues>
    <name>Проведено</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаСудно</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Доработан</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/vftСтатусыДокументаРапортОПовреждении/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ИспользоватьФункционалСУБ = ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ");
	
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Черновик"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Отправлен"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Получен"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Закрыт"));
		
	Если ИспользоватьФункционалСУБ Тогда		
		ДанныеВыбора.Удалить(ДанныеВыбора.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.vftСтатусыДокументовСообщений.Получен")));
	КонецЕсли;

КонецПроцедуры
